In [1]:
import pandas as pd

In [20]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [21]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [22]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [23]:
result = pd.concat([df1, df2], ignore_index=True)

In [24]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [25]:
result = df1.append(df2, ignore_index=True)

/var/folders/f2/7b9s_xgn3cv40p3qhtn7xs840000gn/T/ipykernel_2780/3488875392.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result = df1.append(df2, ignore_index=True)

In [26]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [27]:
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [28]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [29]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [31]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [32]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  developer  45  Korea

In [33]:
label = [1, 2, 3, 4, 5]
prediction = [1, 2, 2, 4, 4]

In [34]:
comparison = pd.DataFrame({'label' : label, 'prediction' : prediction})

In [36]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4